#+OPTIONS: toc:nil author:nil

* Use

#+begin_src bash :results raw :wrap example :exports both
./website help
#+end_src

#+RESULTS:
#+begin_example
usage: ./website msg

  Message              | Effect
  ---------------------+-------------------------------------------------------------
  help                 | Print this message.
  ---------------------+-------------------------------------------------------------
  context              | Build an environment with all necessary
                       | development dependencies.
  ---------------------+-------------------------------------------------------------
  html                 | Generate HTML for the content.
  ---------------------+-------------------------------------------------------------
  test                 | Execute tests.
  ---------------------+-------------------------------------------------------------
  dist                 | Build an archive.
  ---------------------+-------------------------------------------------------------
  install              | Install the website on the current system.
  ---------------------+-------------------------------------------------------------
  activate             | Activate the website service on the current system.
  ---------------------+-------------------------------------------------------------
  deploy ip user group | Send, install, and activate an archive on a
                       | remote server using ip and user.
  ---------------------+-------------------------------------------------------------
  deploy               | Like `deploy ip user group`, using default values.
#+end_example

